

<template>
  <div>
    <!-- js原生数组变化，是怎么导致页面更新的？重排重绘所有 -->
    <!-- 频繁操作dom会引发重排重绘--》性能问题 -->
    <!-- v-for数组更新是如何更新页面的？ -->
    <!--  -->
    <!-- v-for循环的时候会首先会在内存中产生一个虚拟dom结构 -->
    <!-- 1.当v-for再次更新时，会循环出一个新的虚拟dom结构采用diff算法同级比较旧dom结构。 -->
    <!-- 2. diff算法： -->
    <!-- 2.1 如果虚拟dom根元素变化，会删除整个dom结构删除重建。 -->
    <!-- 2.2 如果是虚拟dom根元素不会，只是根标签属性变化，直接更新属性 -->
    <!-- 2.3 如果是虚拟dom根元素内子标签发生了改变： -->
    <!-- key只能是唯一的字符串/数字 （有id用id，无id用索引）-->
    <!-- 2.3.1 如果有key属性 ：根据key比较新旧虚拟dom,只更新更新的内容-->
    <!-- 2.3.2 如果没有key属性：会最大限度尝试就地更新/复用相同标签 -->

    <!-- 2.最后在内存中比较变化的内容，然后给真实dom打布丁（更新），尝试复用标签和就地更新内容 -->
    <!-- 虚拟dom: 即保存节点类型，内容，子节点信息的js对象 -->
    <!-- 虚拟dom的好处： 对比新旧变化内容时：虚拟dom内容比真实内容要少。遍历对比速度更快 -->
  </div>
</template>

<script>
export default {};
</script>